/*********************************************************************
@file	CameraActionDead.h
@brief	カメラアクション（死亡）
@author Yuuho Aritomi
@date	2016/11/21
*********************************************************************/
#pragma once

#include "../CameraAction.h"

class Camera;

class CameraActionDead : public CameraAction
{
public:
	/*****************************************************************
	@brief コンストラクタ
	@param[_camera] カメラ
	*****************************************************************/
	CameraActionDead(Camera* _camera);



	/*****************************************************************
	@brief デストラクタ
	*****************************************************************/
	~CameraActionDead() override;



	/*****************************************************************
	@brief 実行
	*****************************************************************/
	void run(void) override;

private:
	Camera* m_camera;
};