/****************************************************************
@file	CameraActionLockOn.h
@brief	ロックオン時のカメラ
@author Yuuho Aritomi
@date	2016/11/21
****************************************************************/
#pragma once

#include "ICameraWork.h"

class Camera;

class CameraWorkLockOn : public ICameraWork
{
public:
	/************************************************************
	@brief コンストラクタ
	@param[_camera] カメラ
	************************************************************/
	CameraWorkLockOn(Camera* _camera);

	

	/************************************************************
	@brief デストラクタ
	************************************************************/
	~CameraWorkLockOn();



	/************************************************************
	@brief 実行
	************************************************************/
	void run(void) override;

private:
	Camera* m_camera;
};