/*********************************************************************
@file	CameraWorkDead.h
@brief	カメラワーク（死亡）
@author Yuuho Aritomi
@date	2016/11/21
*********************************************************************/
#pragma once

#include "ICameraWork.h"

class Camera;

class CameraWorkDead : public ICameraWork
{
public:
	/*****************************************************************
	@brief コンストラクタ
	@param[_camera] カメラ
	*****************************************************************/
	CameraWorkDead(Camera* _camera);



	/*****************************************************************
	@brief デストラクタ
	*****************************************************************/
	~CameraWorkDead() override;



	/*****************************************************************
	@brief 実行
	*****************************************************************/
	void run(void) override;

private:
	Camera* m_camera;
};