/*****************************************************
@file	ACalc.h
@brief	計算処理
@author Yuho Aritomi
@date	2016/09/21
*****************************************************/

#pragma once

#include <gslib.h>

class ACalc
{
public:
	/*************************************************
	@brief コンストラクタ
	*************************************************/
	ACalc(void);


	/*************************************************
	@brief デストラクタ
	*************************************************/
	~ACalc(void);

	/*************************************************
	@brief ラジアンに変換
	@param[_degree] 角度
	*************************************************/
	static float to_rad(float* _degree);

	/*************************************************
	@brief 角度に変換
	@param[_radian] ラジアン
	*************************************************/
	static float to_deg(float* _radian);

private:
	static const float PI;
};